//*****************************************************************************
//    # #              Name   : BmpRead.h
//  #     #            Date   : Feb. 12, 2021
// #    #  #  #     #  Author : Qiwei Wu
//  #     #  # #  # #  Version: 1.0
//    # #  #    #   #
// BMP picture reading.
//*****************************************************************************

#ifndef __BMP_READ_DEFINE__
#define __BMP_READ_DEFINE__

//*****************************************************************************
// Includes
//*****************************************************************************
#include "BaseDef.h"
#include <string.h>
#include <sys/types.h>		//定义了一些常用数据类型，比如size_t
#include <fcntl.h>			//定义了open、creat等函数，以及表示文件权限的宏定义
#include <unistd.h>			//定义了read、write、close、lseek等函数
#include <errno.h>			//与全局变量errno相关的定义
#include <sys/ioctl.h>		//定义了ioctl函数 

//*****************************************************************************
// Variables
//*****************************************************************************
u8 frameBuf[1920*1080*3] __attribute__ ((aligned(64)));

//*****************************************************************************
// Functions
//*****************************************************************************
int BmpRead(char *fileName, u32 memAddress);

#endif
